app/views/projects/create.html.erb

SELECT  "users".* FROM "users" WHERE "users"."user_type" = $1 LIMIT $2  [["user_type", "developer"], ["LIMIT", 11]]
---
<%= label_tag :description %>: <%= text_area_tag :description %><br/><br/>
<%= label_tag :Developers %>: <%= select_tag(:developers,options_from_collection_for_select(User.where(:user_type => "developer"), :id, :name),multiple: true ) %>