app/controllers/bugs_controller.rb

  def list
  	# puts params[:id]
  	@bugs=Bug.joins(:project).where(:projects=> {id: params[:id]})
---
SELECT "bugs".* FROM "bugs" INNER JOIN "projects" ON "projects"."id" = "bugs"."project_id" WHERE "projects"."project_id" = $1  [["project_id", "9"]]

  def create
    if session[:id].present? then
      project_users=ProjectUser.where(:project_id => params[:id])
      if project_users.present? then
---
SELECT  "project_users".* FROM "project_users" WHERE "project_users"."project_id" = $1 LIMIT $2  [["project_id", 12], ["LIMIT", 1]]
SELECT  "project_users".* FROM "project_users" WHERE "project_users"."user_id" = $1 LIMIT $2  [["user_id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def create_process
    if session[:id].present? then
      bug= Bug.new
      bug.project_id=params[:project][:id]
      bug.description=params[:description]
      bug.title=params[:title]
      bug.bug_type=params[:bug_type]
      if bug.bug_type=="feature" then
        bug.status=params[:feature_status]
      else
        bug.status=params[:bug_status]
      end
      bug.createdby_id=session[:id];
---
INSERT INTO "bugs" ("createdby_id", "assignedto_id", "project_id", "title", "description", "deadline", "screenshot", "bug_type", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"