app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["description", "description"], ["created_at", "2018-03-14 09:22:19.778830"], ["updated_at", "2018-03-14 09:22:19.778830"]]
INSERT INTO "project_users" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 7], ["user_id", 11], ["created_at", "2018-03-14 10:21:52.145988"], ["updated_at", "2018-03-14 10:21:52.145988"]]
---
	def create_process

		if session[:id].present? && session[:role]== "manager" then
			req=params
			project = Project.new()
			project.title=req["title"]
			project.description=req["description"]

			if project.save then
				req["developers"].each do |developer_id|
					ProjectUser.create(:user_id=> developer_id,:project_id =>project.id)

SELECT "users".* FROM "users" INNER JOIN "project_users" ON "project_users"."user_id" = "users"."id" WHERE "project_users"."project_id" = $1  [["project_id", 10]]
---
	def userslist
		if session[:id].present?  && session[:role]== "manager" then
			@users=User.joins(:project_users).where(:project_users=> {project_id: params[:id]})

SELECT "project_users".* FROM "project_users" WHERE "project_users"."project_id" = $1  [["project_id", 7]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 7]]
---
	def delete
		if session[:id].present?  && session[:role]== "manager" then
			user=ProjectUser.where(:user_id => session[:id], :project_id => params[:id])
			if user.present? then
				Project.destroy(params[:id])