app/controllers/users_controller.rb

	def signup_process
		@req=params[:user]
		@user = User.new()
		@user.name=@req["name"]
		@user.email=@req["email"]
		@user.password=@req["password"]
		@user.user_type= @req["user_type"]
		if @user.save then
---
INSERT INTO "users" ("name", "email", "password", "user_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "sufian"], ["email", "s@sd.com"], ["password", "12345678765432"], ["user_type", "qa"], ["created_at", "2018-03-13 15:38:54.982023"], ["updated_at", "2018-03-13 15:38:54.982023"]]

	def signin_process
		req=params[:user]
		user=User.where(:email => req["email"]).first
		if user.present? then
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "s@sd.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

	def dashboard
		if session[:id].present? then
			@session=session
			@projects=Project.joins(:project_users).where(:project_users => {user_id: session[:id]}).distinct
---
SELECT DISTINCT "projects".* FROM "projects" INNER JOIN "project_users" ON "project_users"."project_id" = "projects"."id" WHERE "project_users"."user_id" = $1  [["user_id", 9]]